package cn.tedu.util;

public class NameUtil {
	
	private static String xing="赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊於惠甄曲家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂";
		
	private static String ming="事发地时美丽阿里山的框架房号撒谎都发我而死的番外二偶尔发染发豹女日按本次课登录军建红宏达将伟昌茂小大俊君均辉王宝录睡行枯竭和美化爱雷锋拉克发货送到法国接口和冬瓜律法膨化莲女折为成折得折挨成折改孙成红埃连丁冬芹孙立军张虎豹张亮贾大林王璐郑成枝张国厚杨福林马果树刘埃牛万富郭二旦马占云石玉兰尚文清杨海清越建利祥飞云王银喜树林贾飞世贾埃罗贾永世贾伟刚贾虎世贾熹贾小龙贾飞小刘埃生祥贾桂林申根换申换訾存贵喜喜满贵润生刚龙丽萍桂平李熙平董三女李开英刘再海康永根刘来有石双厚天利刘龙栓成李二美辛文斌根厚建军正厚占宽耀清六石俊梅刘飞文明文利四孬文军文军富存文忠贾乐栓柱龙海龙露桂香焕树二兵凤英有山崎茂仁康桃花杜元晓张海宝高建明张飞雄刘御润佘永强郭三梅杜云魏红继牛武莱高桂清永强文渊二媛二锁志宏金媛双宝焕锁瑞军飞鹏胜厚振清禅第三方接口日暮下瓦房数量的开发和梵蒂冈的帅哥个人违法尽快开回家";
	
	public static String getName(){
		
		int a = (int) (Math.random()*271);
		int b = (int) (Math.random()*384);
		int c = (int) (Math.random()*384);
		int d = (int) (Math.random()*2);
		if(d==1){
			String name=xing.charAt(a)+""+ming.charAt(b);
			return name;
		}else{
			String name=xing.charAt(a)+""+ming.charAt(b)+ming.charAt(c);
			return name;
		}
	}
}
